app/controllers/movies_controller.rb

	redirect_to movies_path :sort_by=>@sort_by, :ratings=>@ratings
	end
	if @ratings and @sort_by
	@movies = Movie.where(:rating => @ratings.keys).find(:all, :order => (sort_by))
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG')

	elsif @sort_by
	@movies = Movie.find(:all, :order => (@sort_by))
	else
	@movies = Movie.all
---
SELECT "movies".* FROM "movies" ORDER BY release_date